sdaiCreateADB(SdaiPrimitiveType,BTEllipsis)
\details
Creates an ADB with type and value preset.
\param valueType [in] typee of the init values.
\param ... [in] init values.
\returns Returns created ADB if success, in other case returns NULL.